---
kind: type
id: T:Autodesk.Revit.DB.TableCellCalculatedValueData
source: html/d7f874df-30a8-cf03-f24c-c66f2be91a39.htm
---
# Autodesk.Revit.DB.TableCellCalculatedValueData

The TableCellCalculatedValueData stores the data for calculated value

## Syntax (C#)
```csharp
public class TableCellCalculatedValueData : IDisposable
```